Kelompok 5\n
1. 120450105 - Devri Zefanya \n
2. 121450039 - A. RAFI PANGGOM IWARI \n
3. 121450072 - CATHERINE FIRDHASARI MAULINA SINAGA \n
4. 121450081 - ANISA DINI AMALIA \n
5. 121450093 - ANISSA LUTHFI ALIFIA \n

In [16]:
! pip3 install pymysql
! pip3 install ipython-sql
! pip3 install mysqlclient

Requirement already satisfied: pymysql in c:\users\my asus\anaconda3\lib\site-packages (1.0.3)
Collecting ipython-sql
  Using cached ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Collecting sqlparse
  Using cached sqlparse-0.4.4-py3-none-any.whl (41 kB)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.15-cp38-cp38-win_amd64.whl (2.0 MB)
Requirement already satisfied: six in c:\users\my asus\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils in c:\users\my asus\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable
  Using cached prettytable-3.7.0-py3-none-any.whl (27 kB)
Requirement already satisfied: ipython in c:\users\my asus\anaconda3\lib\site-packages (from ipython-sql) (7.19.0)
Collecting greenlet!=0.4.17; platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32")))))
  Downloading greenlet-2.0.2-cp38-cp38-win_amd64.whl (192 kB)
Collecting typing-extensions>=4.2.0
  Downloading typing_extensions-4.6.2-py3-none-any.whl (31 kB)
Requirement already satisfied: wcwidth in c:\users\my asus\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.8)
Requirement already satisfied: pickleshare in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.7.2)
Requirement already satisfied: traitlets>=4.2 in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.0.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: backcall in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.10 in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.17.1)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\my asus\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\my asus\anaconda3\lib\site-packages (from jedi>=0.10->ipython->ipython-sql) (0.7.0)
Installing collected packages: sqlparse, greenlet, typing-extensions, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: greenlet
    Found existing installation: greenlet 0.4.17
    Uninstalling greenlet-0.4.17:
      Successfully uninstalled greenlet-0.4.17
  Attempting uninstall: typing-extensions
    Found existing installation: typing-extensions 3.7.4.3
    Uninstalling typing-extensions-3.7.4.3:
      Successfully uninstalled typing-extensions-3.7.4.3
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.20
    Uninstalling SQLAlchemy-1.3.20:
      Successfully uninstalled SQLAlchemy-1.3.20
Successfully installed greenlet-2.0.2 ipython-sql-0.5.0 prettytable-3.7.0 sqlalchemy-2.0.15 sqlparse-0.4.4 typing-extensions-4.6.2
Requirement already satisfied: mysqlclient in c:\users\my asus\anaconda3\lib\site-packages (2.1.1)

In [17]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\my asus\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\my asus\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\my asus\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\my asus\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\my asus\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [19]:
# import libraries
import os
import pymysql
import pandas as pd
#import mysql.connector

In [20]:
db_name = "test"
db_host = "localhost"
db_username = "root"
db_password = ""

In [21]:

try:
    conn = pymysql.connect(host = db_host,
                          port = int(3306),
                          user = 'root',
                          passwd = db_password,
                          db = db_name)
except e:
    print(e)
    
if conn:
    print("Successfully Connected")
else:
    print("Error")
    
# activate magic function

%load_ext sql
%sql mysql+mysqldb://root@localhost

Successfully Connected

In [22]:
%load_ext sql
%sql mysql+mysqldb://root@localhost

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [113]:
%sql SHOW DATABASES;

 * mysql+mysqldb://root@localhost
18 rows affected.

[('apotik',),
 ('apotik_base',),
 ('belanjageh',),
 ('db_dml_lanjutan',),
 ('db_join_buku',),
 ('db_join_kampus',),
 ('information_schema',),
 ('kepegawaian',),
 ('komik_coba1',),
 ('latihan2',),
 ('latihan_basdat',),
 ('mahasiswa',),
 ('mysql',),
 ('performance_schema',),
 ('phpmyadmin',),
 ('test',),
 ('tubes',),
 ('ujian',)]

In [24]:
%sql create database tubes;

 * mysql+mysqldb://root@localhost
1 rows affected.

[]

In [25]:
%sql use tubes;

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [26]:
%sql show tables;

 * mysql+mysqldb://root@localhost
3 rows affected.

[('pelanggan',), ('rating',), ('restoran',)]

In [27]:
%sql desc pelanggan;

 * mysql+mysqldb://root@localhost
4 rows affected.

[('userID', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('drink_level', 'varchar(50)', 'NO', '', None, ''),
 ('personality', 'varchar(50)', 'NO', '', None, ''),
 ('budget', 'varchar(50)', 'NO', '', None, '')]

In [28]:
%sql desc restoran;

 * mysql+mysqldb://root@localhost
3 rows affected.

[('PlaceID', 'int(20)', 'NO', 'PRI', None, ''),
 ('Latitude', 'int(100)', 'NO', '', None, ''),
 ('Name_Place', 'varchar(100)', 'NO', '', None, '')]

In [29]:
%sql desc rating;

 * mysql+mysqldb://root@localhost
3 rows affected.

[('userID', 'varchar(20)', 'NO', '', None, ''),
 ('PlaceID', 'int(20)', 'NO', '', None, ''),
 ('rating', 'int(5)', 'NO', '', None, '')]

In [31]:
%sql alter table rating ADD CONSTRAINT fk_rating_userID FOREIGN KEY (userID) REFERENCES pelanggan (userID);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [32]:
%sql alter table rating ADD CONSTRAINT fk_rating_PlaceID FOREIGN KEY (PlaceID) REFERENCES restoran (PlaceID);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [39]:
%sql select * from pelanggan;

 * mysql+mysqldb://root@localhost
30 rows affected.

[('U1001', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1002', 'abstemious', 'hunter-ostentatious', 'low'),
 ('U1003', 'social drinker', 'hard-worker', 'low'),
 ('U1004', 'abstemious', 'hard-worker', 'medium'),
 ('U1005', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1006', 'social drinker', 'hard-worker', 'medium'),
 ('U1007', 'casual drinker', 'thrifty-protector', 'low'),
 ('U1008', 'social drinker', 'hard-worker', 'low'),
 ('U1009', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1010', 'social drinker', 'hard-worker', 'medium'),
 ('U1011', 'abstemious', 'hard-worker', 'medium'),
 ('U1012', 'casual drinker', 'hard-worker', 'medium'),
 ('U1013', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1014', 'abstemious', 'hard-worker', 'medium'),
 ('U1015', 'social drinker', 'thrifty-protector', 'medium'),
 ('U1016', 'casual drinker', 'thrifty-protector', 'medium'),
 ('U1017', 'casual drinker', 'hunter-ostentatious', 'medium'),
 ('U1018', 'casual drinker', 'thrifty-protector', 'low'),
 ('U1019', 'casual drinker', 'thrifty-protector', 'medium'),
 ('U1020', 'abstemious', 'hard-worker', 'medium'),
 ('U1021', 'social drinker', 'hard-worker', 'medium'),
 ('U1022', 'casual drinker', 'hard-worker', 'medium'),
 ('U1023', 'casual drinker', 'hard-worker', 'low'),
 ('U1024', 'abstemious', 'hard-worker', 'medium'),
 ('U1025', 'social drinker', 'thrifty-protector', 'medium'),
 ('U1026', 'abstemious', 'hunter-ostentatious', 'medium'),
 ('U1027', 'social drinker', 'thrifty-protector', 'low'),
 ('U1028', 'abstemious', 'hard-worker', 'medium'),
 ('U1029', 'casual drinker', 'conformist', 'low'),
 ('U1030', 'social drinker', 'hard-worker', 'low')]

In [40]:
%sql select * from restoran;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(132560, 238, 'puesto de gorditas'),
 (132583, 1892, 'McDonalds Centro'),
 (132584, 2375, 'Gorditas Dona Tota'),
 (132594, 2375, 'tacos de barbacoa enfrente del Tec'),
 (132626, 2373, 'la perica hamburguesa'),
 (132654, 2373, 'Carnitas Mata Calle 16 de Septiembre'),
 (132660, 2375, 'carnitas mata calle Emilio Portes Gil'),
 (132663, 2375, 'tacos abi'),
 (132754, 2214, 'Cabana Huasteca'),
 (132755, 2215, 'La Estrella de Dimas'),
 (132766, 1891, 'Mikasa'),
 (132866, 2214, 'Chaires'),
 (132877, 2213, 'sirloin stockade'),
 (132921, 2215, 'crudalia'),
 (134976, 1891, 'Log Yin'),
 (134986, 189, 'Restaurant Las Mananitas'),
 (134996, 1892, 'Sanborns Casa Piedra'),
 (135019, 1887, 'Restaurant Bar Coty y Pablo'),
 (135028, 2214, 'La Virreina'),
 (135032, 2215, 'Cafeteria y Restaurant El Pacifico'),
 (135043, 2218, 'pizza clasica'),
 (135049, 2213, 'Restaurante de Mariscos la Langosta'),
 (135058, 2216, 'Restaurante Tiberius'),
 (135062, 222, 'Restaurante El Cielo Potosino'),
 (135072, 2214, 'Sushi Itto'),
 (135073, 2214, 'Restaurante Bar El Gallinero'),
 (135075, 2213, 'Mariscos El Pescador'),
 (135085, 222, 'Tortas Locas Hipocampo'),
 (135088, 1887, 'Cafeteria cenidet'),
 (135109, 1892, 'Paniroles')]

In [45]:
%sql UPDATE restoran SET Latitude = NULL;

 * mysql+mysqldb://root@localhost
31 rows affected.

[]

In [47]:
%sql select * from restoran;

 * mysql+mysqldb://root@localhost
31 rows affected.

[(0, 0, ''),
 (132560, 0, 'puesto de gorditas'),
 (132583, 0, 'McDonalds Centro'),
 (132584, 0, 'Gorditas Dona Tota'),
 (132594, 0, 'tacos de barbacoa enfrente del Tec'),
 (132626, 0, 'la perica hamburguesa'),
 (132654, 0, 'Carnitas Mata Calle 16 de Septiembre'),
 (132660, 0, 'carnitas mata calle Emilio Portes Gil'),
 (132663, 0, 'tacos abi'),
 (132754, 0, 'Cabana Huasteca'),
 (132755, 0, 'La Estrella de Dimas'),
 (132766, 0, 'Mikasa'),
 (132866, 0, 'Chaires'),
 (132877, 0, 'sirloin stockade'),
 (132921, 0, 'crudalia'),
 (134976, 0, 'Log Yin'),
 (134986, 0, 'Restaurant Las Mananitas'),
 (134996, 0, 'Sanborns Casa Piedra'),
 (135019, 0, 'Restaurant Bar Coty y Pablo'),
 (135028, 0, 'La Virreina'),
 (135032, 0, 'Cafeteria y Restaurant El Pacifico'),
 (135043, 0, 'pizza clasica'),
 (135049, 0, 'Restaurante de Mariscos la Langosta'),
 (135058, 0, 'Restaurante Tiberius'),
 (135062, 0, 'Restaurante El Cielo Potosino'),
 (135072, 0, 'Sushi Itto'),
 (135073, 0, 'Restaurante Bar El Gallinero'),
 (135075, 0, 'Mariscos El Pescador'),
 (135085, 0, 'Tortas Locas Hipocampo'),
 (135088, 0, 'Cafeteria cenidet'),
 (135109, 0, 'Paniroles')]

In [48]:
%sql delete from restoran;

 * mysql+mysqldb://root@localhost
31 rows affected.

[]

In [50]:
%sql select * from restoran;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(132560, 237523, 'puesto de gorditas'),
 (132583, 1892229, 'McDonalds Centro'),
 (132584, 2375236, 'Gorditas Dona Tota'),
 (132594, 2375217, 'tacos de barbacoa enfrente del Tec'),
 (132626, 2373758, 'la perica hamburguesa'),
 (132654, 2373552, 'Carnitas Mata Calle 16 de Septiembre'),
 (132660, 2375294, 'carnitas mata calle Emilio Portes Gil'),
 (132663, 2375251, 'tacos abi'),
 (132754, 2214774, 'Cabana Huasteca'),
 (132755, 2215332, 'La Estrella de Dimas'),
 (132766, 1891018, 'Mikasa'),
 (132866, 2214122, 'Chaires'),
 (132877, 2213536, 'sirloin stockade'),
 (132921, 2215031, 'crudalia'),
 (134976, 1891665, 'Log Yin'),
 (134986, 189288, 'Restaurant Las Mananitas'),
 (134996, 1892343, 'Sanborns Casa Piedra'),
 (135019, 1887501, 'Restaurant Bar Coty y Pablo'),
 (135028, 2214666, 'La Virreina'),
 (135032, 2215248, 'Cafeteria y Restaurant El Pacifico'),
 (135043, 2218576, 'pizza clasica'),
 (135049, 2213501, 'Restaurante de Mariscos la Langosta'),
 (135058, 2216559, 'Restaurante Tiberius'),
 (135062, 221537, 'Restaurante El Cielo Potosino'),
 (135072, 2214919, 'Sushi Itto'),
 (135073, 2214718, 'Restaurante Bar El Gallinero'),
 (135075, 2213957, 'Mariscos El Pescador'),
 (135085, 221508, 'Tortas Locas Hipocampo'),
 (135088, 1887601, 'Cafeteria cenidet'),
 (135109, 1892178, 'Paniroles')]

In [51]:
%sql select * from rating;

 * mysql+mysqldb://root@localhost
30 rows affected.

[('U1001', 134996, 2),
 ('U1002', 132755, 2),
 ('U1003', 135043, 2),
 ('U1004', 132654, 1),
 ('U1005', 135049, 1),
 ('U1006', 135073, 0),
 ('U1007', 132560, 1),
 ('U1008', 134976, 0),
 ('U1009', 135075, 1),
 ('U1010', 132660, 2),
 ('U1011', 132921, 1),
 ('U1012', 132594, 1),
 ('U1013', 134986, 1),
 ('U1014', 135062, 0),
 ('U1015', 132766, 1),
 ('U1016', 135088, 1),
 ('U1017', 135058, 0),
 ('U1018', 132754, 1),
 ('U1019', 132584, 2),
 ('U1020', 135032, 1),
 ('U1021', 135028, 1),
 ('U1022', 135085, 1),
 ('U1023', 132663, 2),
 ('U1024', 132626, 2),
 ('U1025', 132583, 2),
 ('U1026', 132866, 2),
 ('U1027', 135072, 2),
 ('U1028', 135109, 1),
 ('U1029', 135019, 2),
 ('U1030', 132877, 1)]

In [53]:
%sql select * from pelanggan limit 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[('U1001', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1002', 'abstemious', 'hunter-ostentatious', 'low'),
 ('U1003', 'social drinker', 'hard-worker', 'low'),
 ('U1004', 'abstemious', 'hard-worker', 'medium'),
 ('U1005', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1006', 'social drinker', 'hard-worker', 'medium'),
 ('U1007', 'casual drinker', 'thrifty-protector', 'low'),
 ('U1008', 'social drinker', 'hard-worker', 'low'),
 ('U1009', 'abstemious', 'thrifty-protector', 'medium'),
 ('U1010', 'social drinker', 'hard-worker', 'medium')]

In [66]:
%sql SELECT pelanggan.userID, restoran.Name_Place, rating.rating 
FROM pelanggan JOIN rating ON pelanggan.userID = rating.userID  JOIN restoran ON rating.PlaceID = restoran.PlaceID limit 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[('U1001', 'Sanborns Casa Piedra', 2),
 ('U1002', 'La Estrella de Dimas', 2),
 ('U1003', 'pizza clasica', 2),
 ('U1004', 'Carnitas Mata Calle 16 de Septiembre', 1),
 ('U1005', 'Restaurante de Mariscos la Langosta', 1),
 ('U1006', 'Restaurante Bar El Gallinero', 0),
 ('U1007', 'puesto de gorditas', 1),
 ('U1008', 'Log Yin', 0),
 ('U1009', 'Mariscos El Pescador', 1),
 ('U1010', 'carnitas mata calle Emilio Portes Gil', 2)]

In [68]:
%sql alter table restoran modify column Latitude BIGINT  not null;

 * mysql+mysqldb://root@localhost
30 rows affected.

[]

In [69]:
%sql desc restoran;

 * mysql+mysqldb://root@localhost
3 rows affected.

[('PlaceID', 'int(20)', 'NO', 'PRI', None, ''),
 ('Latitude', 'bigint(20)', 'NO', '', None, ''),
 ('Name_Place', 'varchar(100)', 'NO', '', None, '')]

In [73]:
%sql SELECT COUNT(userID) AS 'Total Pelanggan', drink_level FROM pelanggan GROUP BY drink_level;

 * mysql+mysqldb://root@localhost
3 rows affected.

[(12, 'abstemious'), (9, 'casual drinker'), (9, 'social drinker')]

In [74]:
%sql SELECT COUNT(userID) AS 'Total Pelanggan', personality FROM pelanggan GROUP BY personality;

 * mysql+mysqldb://root@localhost
4 rows affected.

[(1, 'conformist'),
 (15, 'hard-worker'),
 (3, 'hunter-ostentatious'),
 (11, 'thrifty-protector')]

In [75]:
%sql SELECT COUNT(userID) AS 'Total Pelanggan', budget FROM pelanggan GROUP BY budget;

 * mysql+mysqldb://root@localhost
2 rows affected.

[(9, 'low'), (21, 'medium')]

In [80]:
%sql SELECT pelanggan.*, restoran.Name_Place, rating.userID, rating.PlaceID FROM pelanggan 
JOIN rating ON pelanggan.userID = rating.userID JOIN restoran ON rating.PlaceID = restoran.PlaceID limit 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[('U1001', 'abstemious', 'thrifty-protector', 'medium', 'Sanborns Casa Piedra', 'U1001', 134996),
 ('U1002', 'abstemious', 'hunter-ostentatious', 'low', 'La Estrella de Dimas', 'U1002', 132755),
 ('U1003', 'social drinker', 'hard-worker', 'low', 'pizza clasica', 'U1003', 135043),
 ('U1004', 'abstemious', 'hard-worker', 'medium', 'Carnitas Mata Calle 16 de Septiembre', 'U1004', 132654),
 ('U1005', 'abstemious', 'thrifty-protector', 'medium', 'Restaurante de Mariscos la Langosta', 'U1005', 135049),
 ('U1006', 'social drinker', 'hard-worker', 'medium', 'Restaurante Bar El Gallinero', 'U1006', 135073),
 ('U1007', 'casual drinker', 'thrifty-protector', 'low', 'puesto de gorditas', 'U1007', 132560),
 ('U1008', 'social drinker', 'hard-worker', 'low', 'Log Yin', 'U1008', 134976),
 ('U1009', 'abstemious', 'thrifty-protector', 'medium', 'Mariscos El Pescador', 'U1009', 135075),
 ('U1010', 'social drinker', 'hard-worker', 'medium', 'carnitas mata calle Emilio Portes Gil', 'U1010', 132660)]

In [89]:
%sql SELECT COUNT(PlaceID) AS 'Total Tempat', rating FROM rating GROUP BY rating;

 * mysql+mysqldb://root@localhost
3 rows affected.

[(4, 0), (15, 1), (11, 2)]

In [90]:
%sql SELECT * FROM restoran WHERE Name_Place LIKE 'c%';

 * mysql+mysqldb://root@localhost
7 rows affected.

[(132654, 2373552, 'Carnitas Mata Calle 16 de Septiembre'),
 (132660, 2375294, 'carnitas mata calle Emilio Portes Gil'),
 (132754, 2214774, 'Cabana Huasteca'),
 (132866, 2214122, 'Chaires'),
 (132921, 2215031, 'crudalia'),
 (135032, 2215248, 'Cafeteria y Restaurant El Pacifico'),
 (135088, 1887601, 'Cafeteria cenidet')]

In [92]:
%sql SELECT pelanggan.budget, restoran.Name_Place, rating.rating FROM pelanggan INNER JOIN rating ON pelanggan.userID = rating.userID INNER JOIN restoran ON rating.PlaceID = restoran.PlaceID limit 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[('medium', 'Sanborns Casa Piedra', 2),
 ('low', 'La Estrella de Dimas', 2),
 ('low', 'pizza clasica', 2),
 ('medium', 'Carnitas Mata Calle 16 de Septiembre', 1),
 ('medium', 'Restaurante de Mariscos la Langosta', 1),
 ('medium', 'Restaurante Bar El Gallinero', 0),
 ('low', 'puesto de gorditas', 1),
 ('low', 'Log Yin', 0),
 ('medium', 'Mariscos El Pescador', 1),
 ('medium', 'carnitas mata calle Emilio Portes Gil', 2)]

In [104]:
#membuat hak user root
%sql CREATE USER 'user_root'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [107]:
%sql GRANT ALL PRIVILEGES ON *.* TO 'user_root'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [105]:
#membuat hak user_1
%sql CREATE USER 'user_1'@'%';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [109]:
#tanpa hak akses update
%sql GRANT SELECT, INSERT, DELETE, CREATE, DROP, ALTER ON *.* TO 'user_1'@'%';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [106]:
#membuat hak user_2
%sql CREATE USER 'user_2'@'%';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [110]:
#tanpa hak akses create
%sql GRANT SELECT, INSERT, UPDATE, DELETE, DROP, ALTER ON *.* TO 'user_2'@'%';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

In [111]:
#backup file
#c:\xampp\mysql\bin>mysqldump.exe -u root -p tubes > kelompok05.sql #run di cmd as administrator